[
  {
  "id": 1,
  "title": "Frontend Developer (Intern)",
  "company": "Tm30 Global Limited",
  "location": "Lagos, Nigeria",
  "duration": "February 2024 - Present",
    "description": [
      "I’m currently interning at TM30 Global Limited, where I am designing clean and responsive user interfaces for banking applications using HTML, CSS, and React.js.",
      "I have created a static prototype of the dashboard that meets the design specifications and lays the foundation for future interactivity.",
      "Throughout this process, I am enhancing my JavaScript skills, exploring React Redux and TypeScript.",
      "I collaborate with senior developers during sprint planning, stand‑up meetings, and code reviews to learn best practices."
    ],
  "techStack": [
    "HTML",
    "CSS",
    "JavaScript",
    "React.js",
    "TailwindCSS",
    "Figma"
  ],
  "imageUrl": "/images/logo1.jpeg"
},
  {
    "id": 2,
    "title": "Front. Developer (Academic Projects)",
    "company": "Yaba College of Technology",
    "location": "Lagos, Nigeria",
    "duration": "Novembar 2024 - April 2025",
    "description": [
      "I served as the Frontend Lead on multiple capstone projects, most notably a mobile‑first React Biometric Attendance System integrating Firebase and an Arduino fingerprint scanner, and a Python/OpenCV‑powered OCR Vehicle Verification System.",
      "I focused on building clean, responsive interfaces, ensuring robust API connections, optimized data handling and storage with Firebase, and upholding accessibility and performance standards.",
      "I partnered closely with classmates to lead design reviews, documentation efforts, and presentations to academic panels."
    ],
    "techStack": [
      "React.js",
      "JavaScript",
      "TailwindCSS",
      "Firebase",
      "Python",
      "OpenCV",
      "Tesseract OCR"
    ],
    "imageUrl": "/images/yabatech-logo.jpg"
  },
  {
    "id": 3,
    "title": "Freelancer",
    "company": "Upwork",
    "location": "Lagos, Nigeria",
    "duration": "March 2022 - March 2023",
    "description": [
      "I’ve teamed up with Upwork clients to turn design mockups into fast, responsive sites using HTML, CSS, and vanilla JS.",
      "I build clean, accessible layouts across all browsers and add UX extras like sliders, modals, and live form validation.",
      "I speed things up by trimming assets and lazy‑loading content for snappier load times.",
      "I keep requirements on point and hit every deadline with clear messaging and video calls."
    ],
    "techStack": ["HTML5", "CSS3", "JavaScript"],
    "imageUrl": "/images/upwork.png"
  }
]
